Repository: d6lts/cck
Catalog: translations/includes.*.po
Languages: eo

source: Field name
eo: Nomo de kampo

source: Field type
eo: Speco de kampo

source: Used in
eo: Uzata en

source: No fields have been defined for any content type yet.
eo: Neniuj kampoj estis jam difinitaj por ajna enhavspeco.

source: There are no fields configured for this content type. You can !link.
eo: Neniuj kampoj estas agorditaj por ĉi tiu enhavspeco. Vi povas !link.

source: Add a new field
eo: Aldoni novan kampon

source: To change the order of a field, grab a drag-and-drop handle under the Label column and drag the field to a new location in the list. (Grab a handle by clicking and holding the mouse while hovering over a handle icon.) Remember that your changes will not be saved until you click the Save button at the bottom of the page.
eo: Por ŝanĝi la sinsekvon de kampo, prenu la tenilon sub la Enketa kolumno kaj trenu la kampon al nova loko en la listo. (Prenu la tenilon per klakado kaj tenado de la muso dum ĝi superas la tenilan ikonon.) Memoru ke viaj ŝanĝoj ne konserviĝos ĝis kiam vi klakos la butonon de Konservu sube de la paĝo.

source: Configure
eo: Agordi

source: Name
eo: Nomo

source: Type
eo: Speco

source: Weight
eo: Pezo

source: Operations
eo: Operacioj

source: Above
eo: Super

source: Inline
eo: Enteksta

source: no styling
eo: neniu stilado

source: simple
eo: simpla

source: fieldset
eo: kamparo

source: fieldset - collapsible
eo: kamparo - maletendebla

source: fieldset - collapsed
eo: kamparo - maletendita

source: Field
eo: Kampo

source: Your settings have been saved.
eo: Viaj agordoj estas konservitaj.

source: Add existing field
eo: Aldoni ekzistantan kampon

source: Create new field
eo: Krei novan kampon

source: The machine-readable name of the field. This name cannot be changed later! The name will be prefixed with 'field_' and can include lowercase unaccented letters, numbers, and underscores. You'll be able to choose a human-readable label for the field on next page.
eo: La maŝin-legebla nomo de la kampo. Ĉi tiu nomo ne povas esti poste ŝanĝita! La nomo estas prefiksita kun 'field_' kaj povas inkluzivi minusklajn nesupersignajn literojn, ciferojn kaj substrekoj. Vi povos elekti hom-legeblan etikedon por la kampo en la venonta paĝo.

source: Continue
eo: Daŭrigi

source: No field modules are enabled. You need to <a href="!modules_url">enable one</a>, such as text.module, before you can add new fields.
eo: Neniuj kampaj moduloj estas ŝaltitaj. Vi devas <a href="modules_url">ŝalti ion</a>, kiel text.module, antaŭ ol vi povas aldoni novajn kampojn.

source: Choose the type of value to store and an input method from the list below.
eo: Elektu la specon de valoro por konservi kaj enmetan metodon de la listo sube.

source: Added field %label.
eo: Aldonita etikedo %label.

source: There was a problem adding field %label.
eo: Estis problemo aldonante la kampon %label.

source: The field name %field_name is invalid. The name must include only lowercase unaccentuated letters, numbers, and underscores.
eo: La kampa nomo %field_name ne validas. La nomo rajtas inkluzivi nur minusklajn nesupersignajn literojn, ciferojn kaj substrekojn.

source: The field name %field_name already exists.
eo: La kampa nomo %field_name jam ekzistas.

source: The name 'field_instance' is a reserved name.
eo: La nomo 'field_instance' estas rezervita nomo.

source: Created field %label.
eo: Kreis kampo %label.

source: There was a problem creating field %label.
eo: Estis problemo krei kampon %label.

source: Are you sure you want to remove the field %field?
eo: Ĉu vi certas ke vi volas forigi la kampon %field?

source: If you have any content left in this field, it will be lost. This action cannot be undone.
eo: Se vi havas enhavon maldesktre de ĉi tiu kampo, ĝi estos perdita. Tiu ago ne povas esti malfarata.

source: Removed field %field from %type.
eo: Forigis kampon %field de %type.

source: There was a problem deleting %field from %type.
eo: Estis problemo forigi %field de %type.

source: %type settings
eo: %type agordoj

source: These settings apply only to the %field field as it appears in the %type content type.
eo: Ĉi tiuj agordoj aplikiĝas nur al la kampo de %field kiel ĝi aperas en la enhavspeco %type.

source: Widget
eo: Fenestraĵo

source: Instructions to present to the user below this field on the editing form.
eo: Instrukcioj por prezenti al la uzanto sube de ĉi tiu kampo en la redakta formularo.

source: Default value
eo: Defaŭlta valoro

source: Advanced usage only: PHP code that returns a default value. Should not include &lt;?php ?&gt; delimiters. If this field is filled out, the value returned by this code will override any value specified above. Expected format :<pre>!sample</pre>Using !link_devel's 'devel load' tab on a %type content page might help you figure out the expected format.
eo: Nur por spertuloj: PHP-kodo kiu revenigas defaŭltan valoron. Devas ne inkluzivi $lt;?php ?&gt; disigilojn. Se ĉi tiu kampo estas plenumita, la voloro revenita de la kodo anstataŭigos valoron jam specifita. Atendita formato: <pre>!sample</pre> Uzante la 'devel load' langeto de !link_devel ĉe enhava paĝo de %type devas helpi al vi ekkompreni la atenditan formaton.

source: Global settings
eo: Ĝeneralaj agordoj

source: These settings apply to the %field field in every content type in which it appears.
eo: Ĉi tiuj agordoj aplikiĝas al la kampo %field en ĉiu enhavspeco en kiu ĝi aperas.

source: Required
eo: Bezonata

source: Number of values
eo: Nombro da valoroj

source: Unlimited
eo: Senlima

source: Select a specific number of values for this field, or 'Unlimited' to provide an 'Add more' button so the users can add as many values as they like.
eo: Elektu specifan nombron da valoroj por ĉi tiu kampo, aŭ 'Senlima' por provizi butonon de 'Aldoni pli' por ke uzantoj povas aldoni tiel multe da valoroj kiel ili volas.

source: Warning! Changing this setting after data has been created could result in the loss of data!
eo: Averto! Ŝanĝi ĉi tiun agordon post kiam datumoj kreiĝis, povas rezulti en la perdo de datumoj!

source: Save field settings
eo: Konservi kamp-agordojn

source: The default value PHP code returned an incorrect value.<br/>Expected format: <pre>!sample</pre> Returned value: @value
eo: La defaŭlta valoro de PHP-kodo revenigis neĝustan valoron.<br />Atendita formato: <pre>!sample</pre> Revenigis valoron: @value

source: The default value PHP code created @value which is invalid.
eo: La defaŭlta valoro kiun PHP-kodo kreis @value kiu ne validas.

source: The default value is invalid.
eo: La defaŭlta valoro ne validas.

source: Saved field %label.
eo: Konservis kampon %label.

source: Processing
eo: Traktante

source: The update has encountered an error.
eo: Okazis eraro dum ĝisdatigo.

source: The database has been altered and data has been migrated or deleted.
eo: La datumbazo estis ŝanĝita kaj datumoj estis movitaj aŭ forigitaj.

source: An error occurred and database alteration did not complete.
eo: Eraro okazis kaj datumbaza ŝanĝiĝo ne finiĝis.

source: Processing %title
eo: Traktante %title

source: 1 item successfully processed:
eo: 1 ero sukcese traktita:

source: Content fields table %old_name has been renamed to %new_name and field instances have been updated.
eo: Tabelo de enhavkampoj %old_name estis renomita al %new_name kaj kampaj aperoj ĝisdatiĝis.

source: The content fields table %name has been deleted.
eo: La tabelo de enhavkampoj %name estis forigita.

source: Add another !field value
eo: Aldoni alian valoron de !field

source: If the amount of boxes above isn't enough, click here to add more items.
eo: Se la kvanto da skatoloj supre ne sufiĉas, klaku ĉi tie por aldoni pli da eroj.

source: Referenced node ID
eo: Referenca noda ID

source: Referenced node title
eo: Referenca noda titolo

source: Formatted HTML link to the node
eo: Formatita HTML-ligilo al la nodo

source: Raw number value
eo: Neformatita numera valoro

source: Formatted number value
eo: Formatita numera valoro

source: Raw, unfiltered text
eo: Neformatita, nefiltrita teksto

source: Formatted and filtered text
eo: Formatita kaj filtrita teksto

source: Referenced user ID
eo: ID de uzanto

source: Referenced user name
eo: Referenca uzantnomo

source: Formatted HTML link to referenced user
eo: Formatita HTML-ligilo al referenca uzanto

source: Link URL
eo: Ligila URL

source: Link title
eo: Ligila titolo

source: Formatted HTML link
eo: Formatita HTML-ligilo

source: Image file ID
eo: Bilda dosiera ID

source: Image title
eo: Bilda titolo

source: Image alt text
eo: Bilda alt-teksto

source: Image file name
eo: Bilda dosiera nomo

source: Image path
eo: Bilda vojo

source: Image MIME type
eo: Bilda MIME-speco

source: Image file size
eo: Bilda dosiera grandeco

source: Fully formatted HTML image tag
eo: Plene formatita HTML bilda enketo

source: Appears in : @types
eo: Aperis en : @types

source: Format
eo: Formato

source: Group multiple values
eo: Grupigi multajn valorojn

source: Show
eo: Montri

source: values,
eo: valorojn,

source: Starting from
eo: Komencante de

source: Start from last values
eo: Komencu de lastaj valoroj
