Repository: d6lts/cck
Catalog: po/*.po
Languages: el

source: Maximum length
el: Μέγιστο μήκος

source: The maximum length of the field in characters. Leave blank for an unlimited size.
el: Το μέγιστο μήκος του πεδίου σε χαρακτήρες. Αφήστε το κενό για απεριόριστο μήκος.

source: is equal to
el: είναι ίσο με

source: is not equal to
el: δεν είναι ίσο με

source: matches the pattern
el: ταυτίζεται με το υπόδειγμα

source: Illegal value for %name.
el: Ανεπίτρεπτη τιμή στο %name.

source: Rows
el: Γραμμές

source: "Rows" must be a positive integer.
el: Οι "Γραμμές" πρέπει να είναι θετικός ακέραιος αριθμός.

source: edit
el: τροποποίηση

source: duplicate
el: επανάληψη

source: delete
el: διαγραφή

source: Allowed values
el: Επιτρεπόμενες τιμές

source: The possible values this field can contain. Any other values will result in an error. Enter one value per line.
el: Οι τιμές που επιτρέπεται να περιέχει αυτό το πεδίο. Οποιαδήποτε άλλη τιμή θα θεωρηθεί σφάλμα. Δώστε μία τιμή ανά γραμμή.

source: Allows administrators to define new content types.
el: Επιτρέπει στους διαχειριστές να ορίζουν νέους τύπους ύλης.

source: content types
el: τύποι ύλης

source: list
el: λίστα

source: add content type
el: νέος τύπος ύλης

source: fields
el: πεδία

source: manage fields
el: διαχείριση πεδίων

source: add field
el: νέο πεδίο

source: remove field
el: αφαίρεση πεδίου

source: content
el: ύλη

source: Defines a field type for referencing one node from another. <em>Note: Requires content.module.</em>
el: Ορίζει έναν τύπο πεδίου για να γίνεται αναφορά από έναν κόμβο σε έναν άλλο. <em>Σημείωση: Απαιτεί τη μονάδα content.</em>

source: node reference autocomplete
el: αυτόματη συμπλήρωση αναφοράς κόμβου

source: Content types that can be referenced
el: Τύποι ύλης στους οποίους μπορεί να γίνεται αναφορά

source: No post with that title exists.
el: Δεν υπάρχει καμία καταχώριση με αυτόν τον τίτλο.

source: Defines numeric field types. <em>Note: Requires content.module.</em>
el: Ορίζει αριθμητικούς τύπους πεδίων. <em>Σημείωση: Απαιτεί τη μονάδα content.</em>

source: Minimum
el: Ελάχιστο

source: Maximum
el: Μέγιστο

source: "Minimum" must be a number.
el: Το "Ελάχιστο" πρέπει να είναι αριθμός.

source: "Maximum" must be a number.
el: Το "Μέγιστο" πρέπει να είναι αριθμός.

source: The value of %name may be no smaller than %min.
el: Η τιμή του %name δεν μπορεί να είναι μικρότερη από %min.

source: The value of %name may be no larger than %max.
el: Η τιμή του %name δεν μπορεί να είναι μεγαλύτερη από %max.

source: number
el: αριθμός

source: Defines selection, check box and radio button widgets for text and numeric fields. <em>Note: Requires content.module, text.module and number.module.</em>
el: Ορίζει μηχανισμούς όπως τα κουτάκια επιλογής και τα ραδιοπλήκτρα για πεδία κειμένου και αριθμητικά. <em>Σημείωση: Απαιτεί τη μονάδα content, τη μονάδα text και τη μονάδα number.</em>

source: Defines simple text field types. <em>Note: Requires content.module.</em>
el: Ορίζει τύπους πεδίων απλού κειμένου. <em>Σημείωση: Απαιτεί τη μονάδα content.</em>

source: Plain text
el: Απλό κείμενο

source: Filtered text (user selects input format)
el: Φιλτραρισμένο κείμενο (ο χρήστης επιλέγει μορφή εισόδου κειμένου)

source: Text processing
el: Επεξεργασία κειμένου

source: text
el: κείμενο

source: Defines a field type for referencing a user from a node. <em>Note: Requires content.module.</em>
el: Ορίζει έναν τύπο πεδίου για να γίνεται αναφορά σε ένα χρήστη από έναν κόμβο. <em>Σημείωση: Απαιτεί τη μονάδα content.</em>

source: Invalid user name.
el: Ανεπίτρεπτο όνομα χρήστη.

source: Label
el: Ετικέτα

source: Name
el: Όνομα

source: Description
el: Περιγραφή

source: Operations
el: Ενέργειες

source: Type
el: Τύπος

source: Content types
el: Τύποι ύλης

source: The human-readable name of this content type.
el: Το όνομα αυτού του τύπου ύλης για το χρήστη.

source: A brief description of the content type.
el: Μια σύντομη περιγραφή του τύπου ύλης.

source: Help text
el: Κείμενο οδηγιών

source: Instructions to present to the user when adding new content of this type.
el: Οδηγίες που θα παρουσιάζονται στο χρήστη όταν δημιουργεί νέα ύλη αυτού του τύπου.

source: Title field label
el: Ετικέτα πεδίου τίτλου

source: The label for the title field.
el: Η ετικέτα του πεδίου τίτλου.

source: Save content type
el: Αποθήκευση τύπου ύλης

source: Saved content type %type.
el: Αποθήκευση του τύπου ύλης %type.

source: Are you sure you want to delete the content type %type?
el: Θέλετε σίγουρα να διαγράψετε τον τύπο ύλης %type;

source: If you have any content left in this content type, it will be permanently deleted. This action cannot be undone.
el: Αν έχετε ακόμα ύλη αυτού του τύπου, θα διαγραφεί οριστικά. Η ενέργεια αυτή δεν μπορεί να αναιρεθεί.

source: Delete
el: Διαγραφή

source: Cancel
el: Άκυρο

source: Deleted content type %type.
el: Διαγράφηκε ο τύπος ύλης %type

source: configure
el: διευθέτηση

source: remove
el: αφαίρεση

source: Add existing field
el: Προσθήκη υπάρχοντος πεδίου

source: Add field
el: Νέο πεδίο

source: Create new field
el: Δημιουργία νέου πεδίου

source: The human-readable name of this field.
el: Το όνομα αυτού του πεδίου για το χρήστη.

source: Field type
el: Τύπος πεδίου

source: Create field
el: Δημιουργία πεδίου

source: No field modules are enabled. You need to <a href="%modules_url">enable one</a>, such as text.module, before you can add new fields.
el: Δεν είναι ενεργοποιημένη καμία μονάδα για πεδία. Θα πρέπει να <a href="%modules_url">ενεργοποιήσετε κάποια</a> όπως, για παράδειγμα, τη μονάδα text, για να μπορέσετε να προσθέσετε νέα πεδία.

source: Added field %label.
el: Προστέθηκε το πεδίο %label.

source: Created field %label.
el: Δημιουργήθηκε το πεδίο %label.

source: Are you sure you want to remove the field %field?
el: Θέλετε σίγουρα να αφαιρέσετε το πεδίο %field;

source: If you have any content left in this field, it will be lost. This action cannot be undone.
el: Αν έχετε ακόμα δεδομένα σε τέτοιο πεδίο, θα χαθούν. Η ενέργεια αυτή δεν μπορεί να αναιρεθεί.

source: Remove
el: Αφαίρεση

source: Removed field %field from %type.
el: Αφαιρέθηκε το πεδίο %field από %type.

source: The field %field no longer exists in any content type, so it was deleted.
el: Το πεδίο %field δεν υπάρχει πια σε κανένα τύπο ύλης, γι' αυτό διαγράφηκε.

source: Widget settings
el: Ρυθμίσεις για widget

source: These settings apply only to the %field field as it appears in the %type content type.
el: Οι ρυθμίσεις αυτές ισχύουν μόνο για το πεδίο %field όπως εμφανίζεται στον τύπο ύλης %type.

source: Widget
el: Μηχανισμός

source: Weight
el: Βάρος

source: In the node editing form, the heavier fields will sink and the lighter fields will be positioned nearer the top.
el: Στη φόρμα τροποποίησης κόμβου, τα βαρύτερα πεδία θα βουλιάζουν και τα ελαφρύτερα θα τοποθετούνται πιο κοντά στην κορυφή.

source: Instructions to present to the user below this field on the editing form.
el: Οδηγίες που θα παρουσιάζονται στο χρήστη κάτω από αυτό το πεδίο στη φόρμα τροποποίησης.

source: Data settings
el: Ρυθμίσεις για τα δεδομένα

source: These settings apply to the %field field in every content type in which it appears.
el: Οι ρυθμίσεις αυτές ισχύουν για το πεδίο %field σε κάθε τύπο ύλης που εμφανίζεται.

source: Required
el: Υποχρεωτικό

source: Multiple values
el: Πολλές τιμές

source: Save field settings
el: Αποθήκευση ρυθμίσεων πεδίου

source: Saved field %field.
el: Αποθηκεύτηκε το πεδίο %field

source: No PostgreSQL mapping found for %type data type.
el: Δε βρέθηκε καμία αντιστοιχία στην PostgreSQL για τον τύπο δεδομένων %type.

source: database
el: βάση δεδομένων
